<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Malwarebytes AntiMalware (formerly Adware Medic) and imports into Munki.</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.MalwarebytesAntiMalware</string>
    <key>Identifier</key>
    <string>com.github.lcis.munki.MalwarebytesAntiMalware</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Malwarebytes Anti-Malware</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Malwarebytes AntiMalware (formerly Adware Medic) removes adware, such as Genieo, VSearch, and Vidx. Removes malware, including Trojans.</string>
            <key>display_name</key>
            <string>Malwarebytes AntiMalware</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
