<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports CCC into Munki.</string>
    <key>Input</key>
    <dict>
        <key>IDENTIFIER</key>
        <string>com.github.LyfordCaySchool.lcis-recipes.munki.CrashPlanClient</string>
        <key>NAME</key>
        <string>CrashPlanClient</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/CrashPlanClient</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>CrashPlan client software.</string>
            <key>display_name</key>
            <string>CrashPlan Client</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>ParentRecipe</key>
    <string>com.github.LyfordCaySchool.lcis-recipes.CrashPlanClient.download</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Arguments</key>
    		<dict>
    			<key>additional_pkginfo</key>
    			<dict>
    				<key>version</key>
    				<string>%MATCHED_VERSION%</string>
    			</dict>
    		</dict>
    		<key>Processor</key>
    		<string>MunkiPkginfoMerger</string>
    	</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
