<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports MaxBulkMailer into Munki.</string>
    <key>Input</key>
    <dict>
        <key>IDENTIFIER</key>
        <string>com.github.LyfordCaySchool.lcis-recipes.munki.MaxBulkMailer</string>
        <key>NAME</key>
        <string>MaxBulkMailer</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/MaxBulkMailer</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>MaxBulkMailer software.</string>
            <key>display_name</key>
            <string>MaxBulkMailer</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>ParentRecipe</key>
    <string>com.github.LyfordCaySchool.lcis-recipes.download.MaxBulkMailer</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Arguments</key>
    		<dict>
    			<key>input_plist_path</key>
    			<string>%pathname%/MaxBulk Mailer/MaxBulk Mailer.app/Contents/Info.plist</string>
    		</dict>
    		<key>Processor</key>
    		<string>Versioner</string>
    	</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
