<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Malwarebytes and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.LyfordCaySchool.munki.MalwareBytesAntiMalware</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Malwarebytes</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Security</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Formerly known as Adware Medic, MalwareBytes will scan for and remove popular adware on Macs.</string>
			<key>developer</key>
			<string>Malwarebytes</string>
			<key>display_name</key>
			<string>Malwarebytes Anti-Malware</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# copy the helper tool and set ownership
/bin/cp "/Applications/Malwarebytes Anti-Malware.app/Contents/Library/LaunchServices/com.malwarebytes.MBAMHelperTool" /Library/PrivilegedHelperTools/
/usr/sbin/chown root:wheel "/Library/PrivilegedHelperTools/com.malwarebytes.MBAMHelperTool"
/bin/chmod 755 "/Library/PrivilegedHelperTools/com.malwarebytes.MBAMHelperTool"
# create the launchd, chmod, chown, and load plist
/bin/cat &gt; /Library/LaunchDaemons/com.malwarebytes.MBAMHelperTool.plist &lt;&lt;- ENDLAUNCHDPLIST
&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;
&lt;plist version="1.0"&gt;
&lt;dict&gt;
	&lt;key&gt;Label&lt;/key&gt;
	&lt;string&gt;com.malwarebytes.MBAMHelperTool&lt;/string&gt;
	&lt;key&gt;MachServices&lt;/key&gt;
	&lt;dict&gt;
		&lt;key&gt;com.malwarebytes.MBAMHelperTool&lt;/key&gt;
		&lt;true/&gt;
	&lt;/dict&gt;
	&lt;key&gt;Program&lt;/key&gt;
	&lt;string&gt;/Library/PrivilegedHelperTools/com.malwarebytes.MBAMHelperTool&lt;/string&gt;
	&lt;key&gt;ProgramArguments&lt;/key&gt;
	&lt;array&gt;
		&lt;string&gt;/Library/PrivilegedHelperTools/com.malwarebytes.MBAMHelperTool&lt;/string&gt;
	&lt;/array&gt;
&lt;/dict&gt;
&lt;/plist&gt; 
ENDLAUNCHDPLIST
/usr/sbin/chown root:wheel "/Library/LaunchDaemons/com.malwarebytes.MBAMHelperTool.plist"
/bin/chmod 755 "/Library/PrivilegedHelperTools/com.malwarebytes.MBAMHelperTool.plist"
/bin/launchctl load "/Library/LaunchDaemons/com.malwarebytes.MBAMHelperTool.plist"
			</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/sh
# unload launchdaemon plist and remove, along with app and helper
/bin/launchctl unload "/Library/LaunchDaemons/com.malwarebytes.MBAMHelperTool.plist"
/bin/rm "/Library/LaunchDaemons/com.malwarebytes.MBAMHelperTool.plist"
/bin/rm -rf "/Library/PrivilegedHelperTools/com.malwarebytes.MBAMHelperTool.plist"
/bin/rm -rf "/Applications/Malwarebytes Anti-Malware.app"
			</string>
			<key>uninstallable</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.MalwarebytesAntiMalware</string>
	<key>Process</key>
	<array>
	<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
